a
an
ability
able
about
above
abroad
absent
absolutely
accent
accept
access
accident
accommodation
accompany
according
to
account
accountant
accurate
ache
achieve
across
act
action
active
Activity
actor
actress
actually
ad
add
addition
address
admire
admission
admit
adult
advance
advanced
advantage
adventure
advert
advertise
advertisement
advice
advise
aeroplane
afford
afraid
after
afternoon
afterwards
again
against
age
aged
        agency
ago
agree
ahead
aim
air
air
conditioning
air
force
airline
airport
alarm
alarm
clock
album
alike
alive
all
all
right/alright
allow
almost
alone
along
aloud
alphabet
already
also
although
altogether
always
a.m
amazed
amazing
ambition
ambulance
among
amount
amusing
an
ancient
and
angry
animal
ankle
anniversary
announce
announcement
annoy
annual
another
answer
answerphone
ant
antique
anxious
any
anybody
anymore
anyone
anything
anyway
anywhere
apart
apart
from
apartment
apartment
building
apologise
apology
appear
appearance
apple
application
        apply
appointment
approach
approve
architect
architecture
area
argue
argument
arm
armchair
army
around
arrange
arrangement
arrest
arrival
arrive
art
article
artist
as
ashamed
ask
asleep
aspirin
assistant
as
well
at
        at
all
at
first
athlete
athletics
at
last
at
least
atmosphere
at
once
at
present
attach
attack
attempt
attend
attention
at
the
same
time
attitude
attract
attraction
attractive
audience
aunt
author
autumn
available
average
avoid
awake
away
awful
B
baby
babysit
babysitter
back
background
backpack
backpacker
backpacking
backwards
bad
badly
badminton
bag
baggage
bake
baker
balcony
bald
ball
ballet
balloon
banana
band
bandage
bank
bank
account
banking
bar
barbecue
baseball
base
on
basic
basin
basket
basketball
bat
bath
bathing
suit
bathroom
        bathtub
battery
battle
bay
be
beach
bean
bear
beard
beat
beautiful
beauty
because
because
of
become
bed
bedroom
bee
beef
before
begin
beginner
beginning
behave
behaviour
behind
believe
bell
belong
below
belt
beneath
benefit
be
over
beside
besides
best
better
        between
beyond
bicycle
big
bike
bill
bin
biography
biology
bird
birth
birthday
biscuit
bit
bite
bitter
black
blackboard
blame
blank
blanket
bleed
blind
block
blog
blogger
blond
blood
blouse
blow
blue
board
board
game
boarding
pass
boat
body
boil
boiled
bold
bomb
bone
book
bookcase
booking
booking
office
bookshelf
bookshop
bookstore
boot
border
bored
boring
born
borrow
boss
both
bother
bottle
bottom
bowl
box
boy
boyfriend
bracelet
brain
brake
branch
brand
new
brave
bread
break
break
down
break
in
break
up
breath
breathe
breeze
bride
bridge
brief
bright
brilliant
bring
bring
up
broad
broccoli
brochure
broken
brother
brown
brush
bucket
bug
build
building
bulb
bunch
burn
burning
bury
bus
business
businessman
businesswoman
bus
station
bus
stop
busy
but
butcher
butter
butterfly
button
buy
buyer
by
by
accident
bye
by
hand
by
mistake
by
name
C
cab
cabbage
cabin
cabinet
cable
cafe/cafe
cafeteria
cage
cake
calculator
calendar
calf
call
call
for
calm
camel
camera
camp
camping
campsite
can
canal
cancel
candidate
candle
candy
canteen
cap
capital
car
        card
care
career
careful
carefully
careless
carpet
carrot
carry
carry
out
cartoon
case
cash
cashpoint
castle
casual
catch
cathedral
        cattle
cave
CD
CD
player
CD-Rom
ceiling
celebrate
celebration
celebrity
cell
phone
cent
centimetre
centimeter
central
centre/center
century
cereal
ceremony
certain
certainly
certificate
chain
chair
challenge
challenging
champion
championship
chance
change
channel
chapter
character
charge
charity
charming
chat
chatroom
chatshow
cheap
cheat
check
checkout
cheek
cheerful
cheers!
cheese
chef
chemist
chemistry
cheque
chess
chest
chicken
child
childhood
chilli
chin
chip
chocolate
choice
choose
cinema
circle
circus
city
clap
class
classical
classmate
classroom
clean
cleaner
clear
clearly
clever
click
cliff
climate
climb
climbing
clinic
clock
close
closed
clothes
cloud
cloudy
clown
club
coast
coat
coconut
cod
coffee
coin
cola
cold
collar
colleague
collect
collection
college
colour
colourful
comb
come
comedy
come
on
comfort
comfortable
comic
comma
common
communicate
communication
company
compare
compete
competition
competitor
complain
complaint
complete
complicated
composition
computer
concentrate
concert
conclusion
condition
conference
confident
confirm
confused
confusing
congratulations!
connect
connection
consider
consist
consonant
contact
contain
contents
contest
continent
continue
contract
control
convenient
conversation
convince
cook
cooker
cookie
cooking
cool
copy
corn
corner
correct
correction
cost
costume
cottage
cotton
cough
could
count
country
countryside
couple
courage
course
court
cousin
cover
cow
crash
crazy
cream
create
creative
creature
credit
credit
card
crew
cross
crossing
crossroads
crowd
crowded
cruel
cruise
cry
cucumber
cultural
culture
cup
cupboard
cure
curious
curiously
curly
currency
curriculum
curry
curtain
cushion
custom
customer
customs
cut
cute
cut
up
CV
cycle
cycling
cyclist
D
dad
daily
damage
damaged
dance
dancer
dancing
danger
dangerous
dark
date
day
dead
deaf
deal
dear
decide
decision
declare
decorate
decrease
deep
defeat
defence
defend
definitely
degree
delete
delicious
delighted
deliver
delivery
demand
dentist
depart
department
departure
depend
deposit
description
desert
deserve
design
designer
desk
despite
dessert
destination
destroy
detail
detective
develop
development
diagram
dial
diary
dictionary
die
        diet
difference
different
difficult
difficulty
dig
digital
diningroom
dinner
dinosaur
diploma
direct
direction
directly
director
dirt
dirty
disabled
disadvantage
disagree
disappear
disappoint
disappointed
disappointing
disappointment
disc/disk
disco
discount
discover
discuss
discussion
disease
disgusting
dish
dishwasher
disk
dislike
display
distance
district
disturb
dive
diver
divide
diving
OJ
do
doctor
Dr
document
documentary
dog
doll
dollar
dolphin
donkey
door
dot
double
doubt
down
download
downstairs
dozen
Dr
drag
drama
draw
drawing
dream
dress
dressed
drink
drive
driver
drivinglicence
        drop
drugstore
drum
dry
duck
due
dull
during
dust
dustbin
dusty
duty
duty-free
duvet
DVD
DVD
player
E
each
ear
earache
early
earn
earring
earth
east
eastern
easily
easy
easygoing
eat
economics
edge
education
effect
efficient
effort
egg
either
elbow
elder
elderly
election
electric
electrical
electricity
electronic
elementary
elephant
elevator
else
email
embarrassed
embarrassing
embassy
emergency
        employ
employee
employer
employment
empty
encourage
end
ending
enemy
energy
engaged
engine
engineer
engineering
enjoy
enormous
enough
enquiry
enter
entertain
entertainment
entrance
entry
envelope
environment
environmental
equal
equipment
eraser
        escape
especially
essay
essential
euro
even
evening
event
ever
every
everybody
everyone
everything
everywhere
exact
exactly
examination/exam
examiner
example
excellent
except
exchange
excited
excitement
exciting
excuse
exercise
exhausted
exhibition
exist
exit
expect
expedition
expensive
experience
experienced
experiment
expert
explain
explanation
        explode
explore
explorer
extra
        extraordinary
extremely
extremesport
eye
F
face
face-to-face
facilities
fact
factory
fail
fair
fairly
fall
false
familiar
family
famous
fan
fancy
fantastic
far
fare
farm
farmer
farming
fashion
fashionable
fast
fasten
fast
food
fat
father
fault
favour
favourite
fax
fear
fee
feed
feel
feeling
feellike
female
ferry
festival
fetch
fever
few
fiction
field
        fight
figure
file
fillin
film
filmmaker
filmstar
final
finally
financial
find
fine
finger
finish
fire
firefighter
firework
firm
fish
fishing
fit
fix
flag
flat
flavour
flight
float
flood
floor
flour
flow
flower
flu
flute
fly
fog
foggy
fold
folk
follow
following
        fond
food
fool
foot
football
footballer
for
forbidden
forecast
foreign
foreigner
forest
forever
forget
forgive
fork
form
former
fortnight
fortunately
forward
fountain
frame
free
freeze
freezer
freezing
French
fries
frequent
        fresh
fridge
fried
friend
friendly
friendship
frighten
frightened
frightening
frog
from
front
frozen
fruit
fry
fuel
full
full
stopz
full
time
full-time
fully
fun
funny
fur
furniture
further
furthest
future
G
gain
gap
garage
garden
game
gap
garage
garden
garlic
gas
gas
station
gate
general
generally
generation
generous
gentle
geography
get
giant
gift
giraffe
girl
girlfriend
give
glad
glance
glass
glasses
glove
go
goal
goalkeeper
goat
gold
golden
golf
good
gorgeous
government
go
grab
grade
graduation
gram
grammar
grandchild
grand
ad
        granddaughter
grandfather
grandma
grandmother
grandpa
grandparent
grandson
granny
grant
grape
graphics
grass
grateful
great
green
greet
greeting
grey
grill
grilled
        grocery
store
groom
ground
group
grow
guess
guest
guest-house
guide
guidebook
guilty
guitar
guitarist
gum
guy
gym
gymnastics
H
habit
hair
haircut
hairdresser
hairdryer
half
half-price
hall
hand
handbag
hand-held
handkerchief
handle
hand
out
handsome
handwriting
hang
happen
happy
happily
happiness
harbour
hard
hardly
hat
        hate
have
he
head
headline
headteacher
health
healthy
hear
heart
heat
heating
heater
heavy
heel
height
helicopter
hello
helmet
help
her
herb
here
hero
heroine
hers
herself
hey
hi
hidden
        hide
high
hill
him
himself
hire
historic
historical
history
hit
hobby
hockey
hold
hole
holiday
home
homepage
homework
honest
honestly
honey
honeymoon
hope
hopeful
hopefully
hopeless
horror
hospital
hostel
hot
        hotel
hour
house
housewife
housework
how
however
how
much
hug
huge
        human
humid
hunger
hungry
hunt
hurry
hurt
husband
hut
I
I
ice
ID
idea
identification
identity
card
if
ill
illness
imagination
imagine
immediately
immigration
importance
important
impossible
improve
improvement
in
        in
advance
inch
include
including
incorrect
increase
incredible
indeed
independent
individual
indoor
indoors
industry
inform
information
ingredient
initial
ink
inquiry
insect
inside
insist
install
instance
instructions
instructor
instrument
intend
interest
interested
interesting
intermediate
international
internet
interrupt
interval
interview
into
introduce
introduction
invent
invention
invitation
invite
        involve
iron
ironing
island
issue
IT
it
item
its
itself
J
jacket
jail
jam
jazz
jealous
jeans
jet
jewellery
job
jog
jogging
join
journalist
        journey
judge
jug
juice
jump
jumper
jungle
just
K
kangaroo
keen
keeper
key
kid
kill
kilogramme
kilometre
kind
king
kiss
kit
kitchen
        kite
kitten
knife
knit
knock
knock
down
know
knowledge
knee
L
label
laboratory
lack
ladder
lady
lake
lamb
lamp
land
landscape
language
laptop
large
last
late
lately
        later
latest
laugh
law
lawyer
lay
lead
leader
leaf
league
learn
        least
leave
lecture
left
left-hand
leg
leisure
lemon
lemonade
lend
length
less
lesson
let
letter
lettuce
level
library
licence
lie
lie
down
life
lift
light
lighter
like
likely
limit
limited
lip
liquid
list
listen
literature
litre
litter
little
live
live
living
room
load
loan
local
locate
location
lock
locker
logo
lonely
long
look
like
loose
lorry
lose
lost
lots
I
a
lot
lottery
loud
love
lovely
low
luck
lucky
luggage
lunch
lunchtime
luxury
M
machine
mad
Madam
magazine
magic
magnificent
mail
main
make
make-up
male
man
manage
manager
mango
many
map
mark
market
marriage
married
marry
marvellous
match
mate
material
maths
mathematics
matter
maximum
may
maybe
me
meal
mean
meanwhile
meat
mechanic
medicine
medium
meet
meeting
melon
member
membership
memory
mention
menu
mess
message
messy
        metal
method
metre
microwave
middle
middle-aged
midnight
might
mild
mile
milk
millimetre
million
mind
mine
mineral
water
minimum
minus
minute
mirror
miserable
miss
Miss
Missing
Mistake
mix
mobile
model
modern
moment
money
monkey
month
monument
mood
moon
more
morning
mosquito
most
        mother
motorcycle
motorbike
motor-racing
motorway
mountain
mouse
moustache
mouth
move
movie
Mr
        Mrs
Ms
much
mug
mum
museum
mushroom
music
musical
musician
must
multiply
my
myself
mystery
N
name
narrow
nasty
national
nationality
natural
nature
near
nearby
nearly
neat
necessary
neck
necklace
need
        negative
neighbour
neighbourhood
nephew
nervous
network
never
new
news
newspaper
next
next
to
nice
niece
        night
nightclub
nightlife
nightmare
no
nobody
noise
noisy
none
noon
no
one
normal
normally
north
northeast
northern
northwest
nose
not
note
notebook
notepaper
nothing
        notice
noticeboard
novel
now
nowadays
        nowhere
number
nurse
O
object
obvious
obviously
occasion
occupation
ocean
o'clock
of
off
offer
office
officer
often
oh
oh
dear!
oil
old
old-fashioned
olive
        omelette
on
once
onion
online
onto
open
opera
        operate
operation
opinion
opportunity
opposite
option
or
orange
orchestra
order
ordinary
organisation
organise
original
other
otherwise
ought
our
ours
ourselves
out
outdoor
outdoors
oven
over
overnight
owe
        own
P
pack
page
pain
painful
paint
painter
painting
pair
palace
pale
pants
paper
parcel
pardon
parent
        park
parking
parrot
part
particular
partner
party
passenger
        passport
password
past
pasta
path
patient
pattern
pause
pavement
pay
PC
pea
peace
peaceful
peach
peak
peanut
pear
pedestrian
peel
pen
pence
pencil
penfriend
penguin
penny
people
pepper
per
percent
perfect
perform
performance
performer
perfume
perhaps
period
permanent
permission
permit
permitted
person
personal
personally
persuade
pet
petrol
petrol
station
pharmacy
phone
photo
photocopy
photo
photographer
photography
phrase
physics
piano
pick
picnic
picture
pie
piece
pile
pill
pillow
pilot
pin
pineapple
pink
pipe
pirate
pity
pizza
place
plan
plane
planet
plant
plastic
plate
platform
play
player
playground
pleasant
please
pleased
pleasure
plenty
plug
p.m.
pocket
poem
poet
poetry
point
police
policeman
police
officer
police
station
polite
political
politician
politics
pollution
pool
population
port
position
positive
possibility
possible
possibly
post
poster
postman
postpone
pot
potato
pound
pour
powder
power
powerful
practice
practise
pray
prayer
predict
prefer
pregnant
preparation
prepare
prepared
prescription
presentation
president
press
prevent
previous
previously
price
primary
school
prince
princess
principal
print
prison
prisoner
private
prize
probably
problem
produce
product
profession
professional
professor
program
project
promise
pronounce
pronunciation
proper
property
protect
proud
prove
provide
public
publish
pull
pullover
pump
pump
punish
pupil
puppy
pure
purple
purpose
purse
push
put
put
on
put
out
puzzle
pyjamas
Q
qualification
qualified
quality
quantity
quarter
queen
question
questionnaire
queue
quick
quickly
quiet
quit
        quite
R
rabbit
race
racket
radio
rail
railway
rain
raincoat
rainforest
raise
range
rap
rare
rarely
rather
raw
reach
read
reader
reading
ready
real
        realise
realistic
really
reason
reasonable
reasonably
rebuild
receipt
receive
recent
reception
receptionist
recipe
recognise
recommend
record
recording
recover
recycled
recycling
red
reduce
refreshments
refrigerator
refund
refuse
regarding
        regards
region
register
registration
regret
regular
relation
relation
relationship
relative
relaxation
relaxed
reliable
religion
remain
remember
remind
remove
rent
repair
repeat
replace
reply
report
reporter
request
require
rescue
research
reservation
reserve
resort
respect
responsible
rest
restaurant
result
retire
return
review
revise
revision
reward
rice
rich
ride
rider
right
ring
river
road
roast
rob
rock
role
roll
romance
romantic
roof
room
rose
rough
round
roundabout
route
routine
row
rubber
rubbish
rude
rug
rugby
ruin
rule
ruler
running
S
sad
safe
safely
sail
sailing
salad
salary
sale
salesman/saleswoman
salmon
salt
same
sand
sandal
sandwich
satisfactory
satisfied
sauce
saucepan
saucer
sausage
save
scared
        scarf
scary
scene
scenery
school
schoolchild
science
science
fiction
scientific
scientist
scissors
scooter
score
scream
screen
sculpture
sea
search
seaside
season
seat
seat
belt
second
secondary
secret
secretary
section
security
        see
seem
select
selfish
self-service
sell
send
sense
sensible
sentence
separate
series
serve
several
sew
sex
shake
shall
shame
shampoo
shape
share
shark
sharp
she
sheep
sheet
shine
shiny
ship
shirt
shock
shocked
shocking
shoe
shoot
shop
assistant
shopping
shore
short
shortly
shorts
shoulder
shout
show
shower
shy
sick
side
sight
sign
signal
signature
signpost
silence
silent
silk
silly
silver
similar
simple
since
sincerely
singer
singing
single
sink
sir
sit
site
situated
situation
size
skate
skateboard
skateboarding
skating
ski
skiing
skill
skin
skirt
sky
sleep
sleeve
slice
slim
slip
slowly
small
smart
smile
smoke
smoking
smooth
snack
snake
snow
snowboard
snowboarding
so
soap
soap
opera
soccer
sociable
social
society
sock
sofa
soft
solution
solve
some
somebody
somehow
someone
something
sometimes
somewhere
son
song
soon
sorry
sort
soul
sound
sour
southeast
southern
southwest
souvenir
space
speak
speaker
special
spectacular
speech
speed
spell
spelling
spend
spicy
spill
spinach
spite
spoil
spoon
sport
sports
centre
spot
spy
square
squash
stadium
staff
stage
stall
star
stay
steak
steal
steep
step
sticky
still
stomach
stomach
ache
stone
store
storm
story
straight
strange
stranger
strawberry
stream
street
stress
stressed
stressful
strict
strike
strong
student
studio
study
stupid
style
stylish
subject
subway
succeed
success
successful
such
sudden
suddenly
suffer
sugar
suggest
suggestion
suit
suitable
suitcase
sum
sun
sunbathe
sunglasses
sunny
sunrise
sunset
sunshine
supermarket
supper
support
supporter
suppose
sure
surfboard
surfing
surname
surprise
surprised
surprising
surround
sweater
sweatshirt
sweet
swim
swimmer
swimming
swimsuit
switch
T
table
tablet
table
tennis
take
meeting
take
up
talent
talented
talk
talk
show
tall
tap
taste
tasty
tax
taxi
tea
teach
        teacher
teaching
team
tear
technology
teenager
telephone
television
tell
tennis
tense
tent
term
terrible
terribly
terrific
terrified
test
text
textbook
text
message
than
thank
thanks
that
the
theatre
their
theirs
them
themselves
then
there
therefore
these
they
thick
thief
thin
thing
think
thirsty
this
those
though
thought
throat
through
throw
thumb
thunder
thunderstorm
tick
ticket
tidy
tidy
up
tie
tiger
tight
timetable
tin
tip
tiring
tissue
title
to
toast
toe
together
toilet
tomato
tomorrow
tongue
tonight
too
toothache
toothbrush
toothpaste
top
topic
total
totally
touch
tour
tour
guide
tourism
tourist
tournament
toward
towel
tower
town
toy
track
tracksuit
trade
traditional
traffic
train
tram
transfer
translate
translation
transport
travel
travel
agent
        tree
trend
trick
trip
trousers
truck
trunk
trust
try
tube
tune
tunnel
turkey
        turn
turning
twice
twin
type
typically
tyre
U
ugly
umbrella
unable
unbelievable
uncle
uncomfortable
under
underline
underneath
underpants
understand
underwear
undress
unemployed
unemployment
unexpected
unfair
unfit
unforgettable
unfortunately
unfriendly
unhappy
unhealthy
        uniform
union
unit
unkind
unknown
unimportant
uninterested
uninteresting
universe
university
unless
unlikey
unlucky
unnecessary
unpack
unpleasant
until
unusual
unwell
up
update
upload
upon
upper
upset
upstairs
up
to
urgent
urgently
us
use
useful
user
usual
usually
v
versus
valley
valuable
value
van
vanilla
variety
various
vase
vegetable
        vegetarian
vehicle
very
vet
via
video
video
clip
video
game
view
violin
        virus
visit
visitor
vocabulary
voice
volleyball
volume
vote
vowel
W
wage
wait
waiter
waitress
wake
walk
walking
wall
wallet
want
war
wardrobe
warm
warn
warning
wash
watch
water
waterfall
wave
web
webcam
webpage
website
wedding
week
weekday
weekend
weekly
weigh
weight
welcome
west
western
wet
what
whatever
wheel
wheelchair
when
whenever
where
wherever
whether
which
while,
whilst
white
who
whole
whose
why
wide
wild
wildlife
will
willing
win
wind
window
windscreen
windsurfing
windy
wing
wise
wish
within
without
woman
wonder
wonderful
wood
wooden
wool
word
working
workout
work
out
world
worried
worry
worse
worst
worth
would
wow
wrap
writing
written
wrong
Y
yard
        yet
        young
yeah
        yoga
        your
year
        yoghurt
        yours
yellow
        you
        yourself
yes
        you
know
        youth
yesterday
Z
zebra
zero
        zone
zoo
